/*
Числа от 1 до 100 лежат в массиве, они хаотично перемешанные, от туда изъяли одно число, надо найти, что это за число. алгоритм не должен превышать O(n^2) сложности
*/

let arr = [
	79, 15, 64, 95, 10, 37, 71, 2, 75, 90, 57, 60, 89, 80, 70, 1, 74, 61, 65, 40, 35, 5, 41, 33, 58, 23, 62, 55, 56, 48, 50, 46, 31, 22, 44, 73, 21,
	63, 91, 72, 29, 13, 17, 84, 100, 76, 7, 98, 81, 36, 43, 66, 3, 92, 11, 34, 99, 86, 83, 54, 94, 45, 78, 27, 93, 39, 53, 96, 49, 25, 69, 8, 12, 20,
	88, 32, 9, 67, 19, 47, 24, 16, 4, 18, 30, 26, 82, 85, 38, 52, 68, 51, 97, 87, 6, 14, 77, 28, 42,
]

function findMissingNumber(arr) {
	let sumSeq = ((1 + 100) * 100) / 2
	let sumArr = arr.reduce((acc, item) => acc + item, 0)

	return sumSeq - sumArr
}

console.log(findMissingNumber(arr))
